const graph: Record<string, Record<string, number>> = {
  start: { A: 5, B: 2 },
  A: { C: 4, D: 2 },
  B: { A: 8, D: 7 },
  C: { D: 6, end: 3 },
  D: { end: 1 },
  end: {},
};

/*
  Пример взвешенного графа для алгоритма Дейкстры. Буквы обозначают вершины, 
  а числа — веса рёбер. Алгоритм ищет путь с наименьшей суммой весов 
  от начальной вершины start до конечной end.

          start
        /     |
    5 /       \ 2
    /         \
  A --------- B
  | \    8    |
  |   \       |
  |4    \2    |7    
  \       \   |
  |         \ |
  C --------- D
  |     6    /
  \         /
  |3       /1
  \       /
  \      /
    end
*/
